load_test/report.txt
httperf --client=0/1 --server=localhost --port=8181 --uri=/ --rate=3 --send-buffer=4096 --recv-buffer=16384 --wsesslog=10,0.100,./urls.txt
httperf: warning: open file limit > FD_SETSIZE; limiting max. # of open files to FD_SETSIZE
Maximum connect burst length: 1

Total: connections 10 requests 10240 replies 10240 test-duration 425.419 s

Connection rate: 0.0 conn/s (42541.9 ms/conn, <=10 concurrent connections)
Connection time [ms]: min 415642.2 avg 419421.6 max 422751.6 median 0.0 stddev 2356.0
Connection time [ms]: connect 1.0
Connection length [replies/conn]: 1024.000

Request rate: 24.1 req/s (41.5 ms/req)
Request size [B]: 72.0

Reply rate [replies/s]: min 13.2 avg 24.1 max 26.2 stddev 1.6 (85 samples)
Reply time [ms]: response 309.0 transfer 0.0
Reply size [B]: header 124.0 content 3105.0 footer 2.0 (total 3231.0)
Reply status: 1xx=0 2xx=10240 3xx=0 4xx=0 5xx=0

CPU time [s]: user 63.31 system 353.44 (user 14.9% system 83.1% total 98.0%)
Net I/O: 77.6 KB/s (0.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0

Session rate [sess/s]: min 0.00 avg 0.02 max 1.20 stddev 0.14 (10/10)
Session: avg 1.00 connections/session
Session lifetime [s]: 419.4
Session failtime [s]: 0.0